; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	image0 - mode
	image2 - mode
	infrared5 - mode
	spectrograph3 - mode
	thermograph1 - mode
	image4 - mode
	spectrograph6 - mode
	GroundStation0 - direction
	GroundStation4 - direction
	Star2 - direction
	Star6 - direction
	Star1 - direction
	GroundStation5 - direction
	Star3 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star3)
	(supports instrument1 image2)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument2 image4)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star1)
	(supports instrument3 infrared5)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 Star1)
	(supports instrument4 spectrograph3)
	(supports instrument4 image0)
	(supports instrument4 image4)
	(supports instrument4 spectrograph6)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
)
(:goal (and
	(have_image Star7 spectrograph6)
	(have_image Planet8 spectrograph6)
	(have_image Planet8 infrared5)
	(have_image Planet9 image4)
	(have_image Planet9 image2)
	(have_image Planet10 spectrograph3)
	(have_image Phenomenon11 image4)
	(have_image Star12 image4)
	(have_image Star12 thermograph1)
	(have_image Star13 image2)
	(have_image Star13 image4)
	(have_image Planet14 infrared5)
))

)

; plan
1. (turn_to satellite1 groundstation5 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation5)
   goals met: 0 of 12
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 12
3. (calibrate satellite1 instrument4 groundstation5)
   added: (calibrated instrument4)
   goals met: 0 of 12
4. (turn_to satellite1 planet10 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 planet10)
   goals met: 0 of 12
5. (take_image satellite1 planet10 instrument4 spectrograph3)
   added: (have_image planet10 spectrograph3)
   goals met: 1 of 12
6. (turn_to satellite1 phenomenon11 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon11)
   goals met: 1 of 12
7. (turn_to satellite0 star1 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star1)
   goals met: 1 of 12
8. (take_image satellite1 phenomenon11 instrument4 image4)
   added: (have_image phenomenon11 image4)
   goals met: 2 of 12
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 12
10. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 2 of 12
11. (turn_to satellite0 planet9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet9)
   goals met: 2 of 12
12. (take_image satellite0 planet9 instrument0 image2)
   added: (have_image planet9 image2)
   goals met: 3 of 12
13. (turn_to satellite0 star12 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star12)
   goals met: 3 of 12
14. (take_image satellite0 star12 instrument0 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 4 of 12
15. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 4 of 12
16. (take_image satellite0 star13 instrument0 image2)
   added: (have_image star13 image2)
   goals met: 5 of 12
17. (turn_to satellite1 planet8 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet8)
   goals met: 5 of 12
18. (take_image satellite1 planet8 instrument4 spectrograph6)
   added: (have_image planet8 spectrograph6)
   goals met: 6 of 12
19. (turn_to satellite1 planet9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet9)
   goals met: 6 of 12
20. (take_image satellite1 planet9 instrument4 image4)
   added: (have_image planet9 image4)
   goals met: 7 of 12
21. (turn_to satellite1 star12 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star12)
   goals met: 7 of 12
22. (take_image satellite1 star12 instrument4 image4)
   added: (have_image star12 image4)
   goals met: 8 of 12
23. (turn_to satellite1 star13 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star13)
   goals met: 8 of 12
24. (take_image satellite1 star13 instrument4 image4)
   added: (have_image star13 image4)
   goals met: 9 of 12
25. (turn_to satellite1 star7 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star7)
   goals met: 9 of 12
26. (take_image satellite1 star7 instrument4 spectrograph6)
   added: (have_image star7 spectrograph6)
   goals met: 10 of 12
27. (switch_off instrument4 satellite1)
   deleted: (power_on instrument4)
   added: (power_avail satellite1)
   goals met: 10 of 12
28. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 10 of 12
29. (turn_to satellite1 groundstation5 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation5)
   goals met: 10 of 12
30. (calibrate satellite1 instrument3 groundstation5)
   added: (calibrated instrument3)
   goals met: 10 of 12
31. (turn_to satellite1 planet14 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 planet14)
   goals met: 10 of 12
32. (take_image satellite1 planet14 instrument3 infrared5)
   added: (have_image planet14 infrared5)
   goals met: 11 of 12
33. (turn_to satellite1 planet8 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet8)
   goals met: 11 of 12
34. (take_image satellite1 planet8 instrument3 infrared5)
   added: (have_image planet8 infrared5)
   goals met: 12 of 12
